src/Catalogs/БЗ_НовостиБазыЗнаний/БЗ_НовостиБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БЗ_НовостиБазыЗнаний</name>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектБазыЗнаний</name>
    <type>
      <types>CatalogRef.БЗ_КатегорииБазыЗнаний</types>
      <types>CatalogRef.БЗ_СтатьиБазыЗнаний</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.БЗ_ВидыНовостейБазыЗнаний</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьАвтор</name>
    <type>
      <types>CatalogRef.БЗ_ПользователиБазыЗнаний</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/БЗ_СтатистикаНовостейБазыЗнаний/БЗ_СтатистикаНовостейБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БЗ_СтатистикаНовостейБазыЗнаний</name>
  <resources>
    <name>Просмотры</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Создана</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Комментарии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Новость</name>
    <type>
      <types>CatalogRef.БЗ_НовостиБазыЗнаний</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/БЗ_НовостиБазыЗнаний/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЧИЕ МЕТОДЫ

Функция ЗначениеДопСвойства(Имя, ПоУмолчанию)
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство(Имя) Тогда
		Возврат ЭтотОбъект.ДополнительныеСвойства[Имя];
	Иначе 
		Возврат ПоУмолчанию;
	КонецЕсли;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ФОРМИРОВАНИЕ ДВИЖЕНИЙ СПРАВОЧНИКА

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ МОДУЛЯ

Процедура ПередЗаписью(Отказ)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтотОбъект.ЭтоНовый());
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоНовыйЭлемент = ЗначениеДопСвойства("ЭтоНовый", Ложь);
	
	Если ЭтоНовыйЭлемент Тогда
		МенеджерЗаписи = РегистрыСведений.БЗ_СтатистикаНовостейБазыЗнаний.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Новость		= ЭтотОбъект.Ссылка;
		МенеджерЗаписи.Создана		= ЭтотОбъект.Дата;
		МенеджерЗаписи.Просмотры	= 0;
		МенеджерЗаписи.Комментарии	= 0;
		МенеджерЗаписи.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры
